MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX675F256L.PIC
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RF13"/>
      <edc:VirtualPin edc:name="U2RTS"/>
      <edc:VirtualPin edc:name="U5TX"/>
      <edc:VirtualPin edc:name="SCK4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RF12"/>
      <edc:VirtualPin edc:name="U2CTS"/>
      <edc:VirtualPin edc:name="U5RX"/>
      <edc:VirtualPin edc:name="SS4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="AECRS"/>
      <edc:VirtualPin edc:name="ERXD0"/>
      <edc:VirtualPin edc:name="AN12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="AECOL"/>
      <edc:VirtualPin edc:name="ERXD1"/>
      <edc:VirtualPin edc:name="AN13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="PMALH"/>
      <edc:VirtualPin edc:name="AETXD3"/>
      <edc:VirtualPin edc:name="ERXD2"/>
      <edc:VirtualPin edc:name="AN14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="CN12"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="PMALL"/>
      <edc:VirtualPin edc:name="OCFB"/>
      <edc:VirtualPin edc:name="AETXD2"/>
      <edc:VirtualPin edc:name="ERXD3"/>
      <edc:VirtualPin edc:name="AN15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="RD14"/>
      <edc:VirtualPin edc:name="CN20"/>
      <edc:VirtualPin edc:name="U1CTS"/>
      <edc:VirtualPin edc:name="U4RX"/>
      <edc:VirtualPin edc:name="SS3"/>
      <edc:VirtualPin edc:name="AETXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="RD15"/>
      <edc:VirtualPin edc:name="CN21"/>
      <edc:VirtualPin edc:name="U1RTS"/>
      <edc:VirtualPin edc:name="U4TX"/>
      <edc:VirtualPin edc:name="SCK3"/>
      <edc:VirtualPin edc:name="AETXD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="CN17"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="U2RX"/>
      <edc:VirtualPin edc:name="SDI4"/>
      <edc:VirtualPin edc:name="SDA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="CN18"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="U2TX"/>
      <edc:VirtualPin edc:name="SDO4"/>
      <edc:VirtualPin edc:name="SCL5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="USBID"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="U1RX"/>
      <edc:VirtualPin edc:name="SDI3"/>
      <edc:VirtualPin edc:name="SDA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RF8"/>
      <edc:VirtualPin edc:name="U1TX"/>
      <edc:VirtualPin edc:name="SDO3"/>
      <edc:VirtualPin edc:name="SCL3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="RG3"/>
      <edc:VirtualPin edc:name="D-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="RG2"/>
      <edc:VirtualPin edc:name="D+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="SDA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 65-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 66-->
      <edc:VirtualPin edc:name="RA14"/>
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="AETXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 67-->
      <edc:VirtualPin edc:name="RA15"/>
      <edc:VirtualPin edc:name="INT4"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="AETXEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 68-->
      <edc:VirtualPin edc:name="RD8"/>
      <edc:VirtualPin edc:name="IC1"/>
      <edc:VirtualPin edc:name="AEMDIO"/>
      <edc:VirtualPin edc:name="EMDIO"/>
      <edc:VirtualPin edc:name="RTCC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="RD9"/>
      <edc:VirtualPin edc:name="IC2"/>
      <edc:VirtualPin edc:name="SS1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="RD10"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="IC3"/>
      <edc:VirtualPin edc:name="SCK1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="IC4"/>
      <edc:VirtualPin edc:name="AEMDC"/>
      <edc:VirtualPin edc:name="EMDC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="OC1"/>
      <edc:VirtualPin edc:name="SDO1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="OC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="OC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="OC4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="RD12"/>
      <edc:VirtualPin edc:name="PMD12"/>
      <edc:VirtualPin edc:name="IC5"/>
      <edc:VirtualPin edc:name="ETXD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 80-->
      <edc:VirtualPin edc:name="RD13"/>
      <edc:VirtualPin edc:name="CN19"/>
      <edc:VirtualPin edc:name="PMD13"/>
      <edc:VirtualPin edc:name="ETXD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 81-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="OC5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 82-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="PMRD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 83-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="ETXEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 84-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="ETXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 85-->
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 86-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 87-->
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="ETXD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 88-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="PMD10"/>
      <edc:VirtualPin edc:name="ETXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 89-->
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="PMD9"/>
      <edc:VirtualPin edc:name="ETXERR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 90-->
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="PMD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 91-->
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="TRCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 92-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="TRD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 93-->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="PMD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 94-->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="PMD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 95-->
      <edc:VirtualPin edc:name="RG14"/>
      <edc:VirtualPin edc:name="TRD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 96-->
      <edc:VirtualPin edc:name="RG12"/>
      <edc:VirtualPin edc:name="TRD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 97-->
      <edc:VirtualPin edc:name="RG13"/>
      <edc:VirtualPin edc:name="TRD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 98-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PMD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 99-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="PMD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 100-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="PMD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 101-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 102-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 103-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 104-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 105-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 106-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 107-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 108-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 109-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 110-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 111-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 112-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 113-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 114-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 115-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 116-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 117-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 118-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 119-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 120-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 121-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
